results/runs/ycsb/2026-05-16T16-02-26/redis/run_workload_c.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadc -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadc -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-16 15:55:56:427 0 sec: 0 operations; est completion in 0 second 
2026-05-16 15:56:01:038 4 sec: 100000 operations; 21431.63 current ops/sec; [READ: Count=100000, Max=19919, Min=77, Avg=503.06, 90=691, 99=1382, 99.9=4623, 99.99=15343] [CLEANUP: Count=10, Max=1937, Min=57, Avg=265.1, 90=123, 99=1937, 99.9=1937, 99.99=1937] 
[OVERALL], RunTime(ms), 4666
[OVERALL], Throughput(ops/sec), 21431.63309044149
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 38
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8144020574367767
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 38
[TOTAL_GC_TIME_%], Time(%), 0.8144020574367767
[READ], Operations, 100000
[READ], AverageLatency(us), 503.06086
[READ], MinLatency(us), 77
[READ], MaxLatency(us), 19919
[READ], 95thPercentileLatency(us), 811
[READ], 99thPercentileLatency(us), 1382
[READ], Return=OK, 100000
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 265.1
[CLEANUP], MinLatency(us), 57
[CLEANUP], MaxLatency(us), 1937
[CLEANUP], 95thPercentileLatency(us), 1937
[CLEANUP], 99thPercentileLatency(us), 1937